tsung_tests/ListUsers.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="20000" use_controller_vm="true" />
  </clients>

  <servers>
    <server host="yonHscaling4t3medium.eba-fz2dfqnp.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="10" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="10" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="10" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="10" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="10" unit="second">
      <users arrivalrate="32" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="6" duration="10" unit="second">
      <users arrivalrate="64" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="7" duration="10" unit="second">
      <users arrivalrate="80" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="8" duration="10" unit="second">
      <users arrivalrate="256" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="9" duration="10" unit="second">
      <users arrivalrate="512" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="10" duration="10" unit="second">
      <users arrivalrate="1024" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>
  </options>

  <sessions>

    <session name="user friend" weight="1" type="ts_http">

      <!-- LOGIN -->
      <request>
        <dyn_variable name="authenticity_token" ></dyn_variable>
        <http url='/d/users/sign_in/' version='1.1' method='GET'></http>
      </request>

      <!-- wait for up to 2 seconds, user is typing names -->
      <thinktime value="2" random="true"></thinktime>

      <!-- create a random number to make a unique first name -->
      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="random_num" />
      </setdynvars>

      <setdynvars code='fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,"[+]","%2B",[global,{return,list}]) end.' sourcetype="eval">
        <var name="encoded_authenticity_token" />
      </setdynvars>

      <!-- user log in -->
      <if var="encoded_authenticity_token" neq="">
        <request subst="true">
          <http
                  url='/d/users/sign_in/'
                  version='1.1'
                  method='POST'
                  content_type="application/x-www-form-urlencoded"
                  contents='authenticity_token=%%_encoded_authenticity_token%%&amp;user%5Bemail%5D=user_%%_random_num%%%40gmail.com&amp;user%5Bpassword%5D=Password1234&amp;user%5Bremember_me%5D=0&amp;commit=Log+in'>
          </http>
        </request>
      </if>


      <!--get users, i.e. go to users page  -->
      <request>
        <dyn_variable name="users_authenticity_token" xpath="//head/meta[@name='csrf-token']/@content"></dyn_variable>
        <dyn_variable name="friend_num_url" xpath="/html/body//div[@class='card-body']/a/@href"></dyn_variable>
        <http url="/users/" version="1.1" method="GET"></http>
      </request>


    </session>

  </sessions>
</tsung>